"""If user don't know what write to bot, we send him this message"""
BASIC = 'Привет! Я телеграмм бот созданный помогать, напиши "/" и появятся подсказки по которым можно задать вопрос'

SEVEN_GRADE_1 = 'Если вы проходили регистрация В ПЕРИОД С 3 ФЕВРАЛЯ ПО 25 МАРТА, то повторно регистрироваться не надо.' \
                '\n\n 1. В связи с пандемией коронавирусной инфекций COVID-19, вступительный экзамен в РФМШ будет ' \
                'проходить в 2 этапа:\n(1) FMPT \n(2) основной экзамен\n\n2. FMPT (Fizmat Math Proficiency Test)' \
                ' – предварительный тест на проверку знаний по математике\n\n3. FMPT НЕ является пробной версией ' \
                'основного вступительного экзамена и отличается по формату, длительности и сложности заданий\n\n' \
                '4. На основной экзамен допускаются только те абитуриенты, которые прошли FMPT тестирование\n\n' \
                'ОСНОВНЫЕ ДАТЫ:\n\n12 июня - 24 июня FMPT тестирование\n\n30 июня - основной экзамен'

SEVEN_GRADE_2 = 'Если вы НЕ проходили регистрация В ПЕРИОД С 3 ФЕВРАЛЯ ПО 25 МАРТА, то вам надо зарегистрироваться ' \
                'https://admissions.fizmat.kz/registraciya-7-klass-almaty-fmpt/' \
                '\n\n 1. В связи с пандемией коронавирусной инфекций COVID-19, вступительный экзамен в РФМШ будет ' \
                'проходить в 2 этапа:\n(1) FMPT \n(2) основной экзамен\n\n2. FMPT (Fizmat Math Proficiency Test)\n\n' \
                '2. Кандидаты, имеющие среднюю оценку 5.0 по математике за весь учебный год проходят FMPT тестирование' \
                ' бесплатно.\n\n3. Кандидаты, имеющие среднюю оценку менее 5.0 по математике за весь учебный год ' \
                'проходят FMPT тестирование на платной основе\n\n4. Стоимость одного FMPT составляет 3000 (три тысячи)' \
                ' KZT\n\nВ случае неявки претендента на FMPT, стоимость экзамена удерживается в полном размере;' \
                '\n\nВ случае перебронирования FMPT на другую дату, стоимость экзамена удерживается в полном размере.' \
                ' Претенденту необходимо повторно зарегистрироваться на выбранную дату и оплатить всю стоимость.\n\n' \
                '5. FMPT (Fizmat Math Proficiency Test) – предварительный тест на проверку знаний по математике\n\n' \
                '6. FMPT не является пробной версией основного вступительного экзамена и отличается по формату, ' \
                'длительности и сложности заданий\n\nНа основной экзамен допускаются только те абитуриенты, ' \
                'которые прошли FMPT тестирование\n\nОСНОВНЫЕ ДАТЫ:\n\n29 мая - 5 июня онлайн регистрация' \
                '\n\n25 июня FMPT тестирование\n\n30 июня - основной экзамен'

FMPT = 'дисциплины: математика, а также задания на логическое мышление\n\n' \
       'формат: тест, с вариантами ответов\n\nколичество заданий: 20\n\n' \
       'длительность: 40 минут – решения теста, 5 минут – заполнения листа ответов\n\n' \
       'результат: на следующий день после сдачи тестирования\n\n' \
       'информация о подготовке к FMPT указана на странице https://admissions.fizmat.kz/kak-gotovitsya/\n\n' \
       'место проведения: РФМШ г. Алматы, бульвар Бухар Жырау, 36'

EIGHT_GRADE = 'Если вы НЕ проходили регистрация В ПЕРИОД С 3 ФЕВРАЛЯ ПО 25 МАРТА, то вам надо зарегистрироваться ' \
              'https://admissions.fizmat.kz/registraciya-7-klass-almaty-fmpt/' \
              '\n\n 1. В связи с пандемией коронавирусной инфекций COVID-19, вступительный экзамен в РФМШ будет ' \
              'проходить в 2 этапа:\n(1) FMPT \n(2) основной экзамен\n\n2. FMPT (Fizmat Math Proficiency Test)\n\n' \
              '2. Кандидаты, имеющие среднюю оценку 5.0 по математике за весь учебный год проходят FMPT тестирование' \
              ' бесплатно.\n\n3. Кандидаты, имеющие среднюю оценку менее 5.0 по математике за весь учебный год ' \
              'проходят FMPT тестирование на платной основе\n\n4. Стоимость одного FMPT составляет 3000 (три тысячи)' \
              ' KZT\n\nВ случае неявки претендента на FMPT, стоимость экзамена удерживается в полном размере;' \
              '\n\nВ случае перебронирования FMPT на другую дату, стоимость экзамена удерживается в полном размере.' \
              ' Претенденту необходимо повторно зарегистрироваться на выбранную дату и оплатить всю стоимость.\n\n' \
              '5. FMPT (Fizmat Math Proficiency Test) – предварительный тест на проверку знаний по математике\n\n' \
              '6. FMPT не является пробной версией основного вступительного экзамена и отличается по формату, ' \
              'длительности и сложности заданий\n\nНа основной экзамен допускаются только те абитуриенты, ' \
              'которые прошли FMPT тестирование\n\nОСНОВНЫЕ ДАТЫ будут скоро изветсны на сайте admission.fizmat.kz'
