SEVEN_GRADE_1 = 'Если вы проходили регистрация В ПЕРИОД С 3 ФЕВРАЛЯ ПО 25 МАРТА, то повторно регистрироваться не надо.' \
                '\n\n 1. В связи с пандемией коронавирусной инфекций COVID-19, вступительный экзамен в РФМШ будет ' \
                'проходить в 2 этапа:\n(1) FMPT \n(2) основной экзамен\n\n2. FMPT (Fizmat Math Proficiency Test)' \
                ' – предварительный тест на проверку знаний по математике\n\n3. FMPT НЕ является пробной версией ' \
                'основного вступительного экзамена и отличается по формату, длительности и сложности заданий\n\n' \
                '4. На основной экзамен допускаются только те абитуриенты, которые прошли FMPT тестирование\n\n' \
                'ОСНОВНЫЕ ДАТЫ:\n\n12 июня - 24 июня FMPT тестирование\n\n30 июня - основной экзамен\n\n\n\n'

SEVEN_GRADE_2 = 'Если вы НЕ проходили регистрация В ПЕРИОД С 3 ФЕВРАЛЯ ПО 25 МАРТА, то вам надо зарегистрироваться ' \
                'https://admissions.fizmat.kz/registraciya-7-klass-almaty-fmpt/' \
                '\n\n 1. В связи с пандемией коронавирусной инфекций COVID-19, вступительный экзамен в РФМШ будет ' \
                'проходить в 2 этапа:\n(1) FMPT \n(2) основной экзамен\n\n2. FMPT (Fizmat Math Proficiency Test)\n\n' \
                '2. Кандидаты, имеющие среднюю оценку 5.0 по математике за весь учебный год проходят FMPT тестирование' \
                ' бесплатно.\n\n3. Кандидаты, имеющие среднюю оценку менее 5.0 по математике за весь учебный год ' \
                'проходят FMPT тестирование на платной основе\n\n4. Стоимость одного FMPT составляет 3000 (три тысячи)' \
                ' KZT\n\nВ случае неявки претендента на FMPT, стоимость экзамена удерживается в полном размере;' \
                '\n\nВ случае перебронирования FMPT на другую дату, стоимость экзамена удерживается в полном размере.' \
                ' Претенденту необходимо повторно зарегистрироваться на выбранную дату и оплатить всю стоимость.\n\n' \
                '5. FMPT (Fizmat Math Proficiency Test) – предварительный тест на проверку знаний по математике\n\n' \
                '6. FMPT не является пробной версией основного вступительного экзамена и отличается по формату, ' \
                'длительности и сложности заданий\n\nНа основной экзамен допускаются только те абитуриенты, ' \
                'которые прошли FMPT тестирование\n\nОСНОВНЫЕ ДАТЫ:\n\n29 мая - 5 июня онлайн регистрация' \
                '\n\n25 июня FMPT тестирование\n\n30 июня - основной экзамен'

FMPT = 'дисциплины: математика, а также задания на логическое мышление\n\n' \
       'формат: тест, с вариантами ответов\n\nколичество заданий: 20\n\n' \
       'длительность: 40 минут – решения теста, 5 минут – заполнения листа ответов\n\n' \
       'результат: на следующий день после сдачи тестирования\n\n' \
       'информация о подготовке к FMPT указана на странице https://admissions.fizmat.kz/kak-gotovitsya/\n\n' \
       'место проведения: РФМШ г. Алматы, бульвар Бухар Жырау, 36'

EIGHT_GRADE = 'Если вы НЕ проходили регистрация В ПЕРИОД С 3 ФЕВРАЛЯ ПО 25 МАРТА, то вам надо зарегистрироваться ' \
              'https://admissions.fizmat.kz/registraciya-7-klass-almaty-fmpt/' \
              '\n\n 1. В связи с пандемией коронавирусной инфекций COVID-19, вступительный экзамен в РФМШ будет ' \
              'проходить в 2 этапа:\n(1) FMPT \n(2) основной экзамен\n\n2. FMPT (Fizmat Math Proficiency Test)\n\n' \
              '2. Кандидаты, имеющие среднюю оценку 5.0 по математике за весь учебный год проходят FMPT тестирование' \
              ' бесплатно.\n\n3. Кандидаты, имеющие среднюю оценку менее 5.0 по математике за весь учебный год ' \
              'проходят FMPT тестирование на платной основе\n\n4. Стоимость одного FMPT составляет 3000 (три тысячи)' \
              ' KZT\n\nВ случае неявки претендента на FMPT, стоимость экзамена удерживается в полном размере;' \
              '\n\nВ случае перебронирования FMPT на другую дату, стоимость экзамена удерживается в полном размере.' \
              ' Претенденту необходимо повторно зарегистрироваться на выбранную дату и оплатить всю стоимость.\n\n' \
              '5. FMPT (Fizmat Math Proficiency Test) – предварительный тест на проверку знаний по математике\n\n' \
              '6. FMPT не является пробной версией основного вступительного экзамена и отличается по формату, ' \
              'длительности и сложности заданий\n\nНа основной экзамен допускаются только те абитуриенты, ' \
              'которые прошли FMPT тестирование\n\nОСНОВНЫЕ ДАТЫ будут скоро изветсны на сайте admission.fizmat.kz'

PEE_7 = 'Основной вступительный экзамен 7 класс\n\n' \
        'дисциплины: математика, а также задания на логическое мышление\n\n' \
        'формат: тест, с вариантами ответов\n\n' \
        'количество заданий: 50\n\n' \
        'длительность: 120 минут – тест, 10 минут – заполнения листа ответов\n\n' \
        'результат: в течение 7 рабочих дней после экзамена\n\n' \
        'информация о подготовке к основному экзамену указана на странице https://admissions.fizmat.kz/kak-gotovitsya/' \
        '\n\n место проведения: РФМШ г. Алматы, бульвар Бухар Жырау, 36'
PEE_8 = 'Основной вступительный экзамен 8 класс\n\n' \
        'дисциплины: алгебра, геометрия, физика\n\n' \
        'формат: тест, с вариантами ответов\n\n' \
        'количество заданий: 50\n\n' \
        'длительность: 120 минут – тест, 10 минут – заполнения листа ответов\n\n' \
        'результат: в течение 7 рабочих дней после экзамена\n\n' \
        'информация о подготовке к основному экзамену указана на странице https://admissions.fizmat.kz/kak-gotovitsya/' \
        '\n\n место проведения: РФМШ г. Алматы, бульвар Бухар Жырау, 36'
WHAT_IS_IT = 'Физмат Эндаумент Фонд (от англ. endowment ‒ вклад) – это специальный фонд, целью которого ' \
             'является обеспечение гарантированного и стабильного негосударственного источника финансирования ' \
             'для нужд РФМШ на многие поколения вперед.\n\nПринцип работы эндаумент фондов схож с депозитным счетом: ' \
             '\фондом собираются средства из добровольных вкладов заинтересованных лиц; эти собранные фондом ' \
             'средства (капитал фонда) никогда - не тратятся, а инвестируются (например, кладутся на депозитный счет)' \
             ', и только полученные от инвестирования проценты тратятся на нужды организации-бенефициара'
BETTER = 'Капитал эндаумент фонда собранный за счет вкладов никогда не тратится и по сути является “вечным”, ' \
         'что в свою очередь гарантирует постоянный стабильный инвестиционный доход для нужд РФМШ.\n\nОбычный ' \
         'благотворительный фонд часто расходует собранные им вклады за раз и нуждается в новых вкладах для ' \
         'продолжения своей деятельности.\n\nБлагодаря принципу работы эндаумент фондов, Физмат Эндаумент ' \
         'Фонд сможет помочь создать финансовую стабильность и служить долговременным источником финансирования ' \
         'для поддержки учителей и учеников РФМШ и для становления РФМШ школой мирового уровня.'
WHO_CAN_BE = 'Поддержать Физмат Эндаумент Фонд может каждый, кто считает свои долгом продолжить в Казахстане ' \
             'наследие РФМШ как одной из сильнейших школ.\n\nСделав вклад в Физмат Эндаумент Фонд, вы навсегда ' \
             'оставите след в истории РФМШ!'
DONATE = 'Сделать вклад вы можете по этой ссылке https://donate.fizmat.kz/'

user_messages = ['👨‍🎓 Поступление', '🤓 FMPT', '📝 Основной вступительный экзамен', '🏫 Ученикам',
                 '💳 Fizmat Endowment Fund', 'Назад', 'Поступление в 7 класс', 'Поступление в 8 класс', '7 класс',
                 '8 класс', '🤷‍♂️Что такое? 🤷‍♀', 'В чем же преимущество', '👨 Кто может стать участником 👩',
                 '💹 Сделать вклад', 'Вернуться']
